#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
#### Terraform Apply 🤖``
#### Terraform Destroy 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_users.all: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principals.all: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_groups.all: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_users.all: Read complete after 0s [id=users#LugH6EUxCvPshOh3k8R_YLHr4qM=][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_user.current_users["Tosh Mackevics"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_user.current_users["Tosh Mackevics Outlook"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_user.current_users["Tosh Mackevics"]: Read complete after 1s [id=e5425b7f-ee23-4012-89fd-f9ab12b3b41f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_groups.all: Read complete after 1s [id=groups#NsKu3v-uOJGCrmbsTjk1vISzKII=][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_group.current_groups["DevOps Engineers"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_user.current_users["Tosh Mackevics Outlook"]: Read complete after 2s [id=d29ad289-6c84-4c04-ba22-ef81624e1279][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_group.current_groups["DevOps Engineers"]: Read complete after 3s [id=84a97bc4-80d6-4643-83b6-9b04c3ac344a][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principals.all: Read complete after 4s [id=serviceprincipals#_TvpfnSxS28tdLbh7lw5L_bYpoU=][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Virtual Desktop Client"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzNS EventHub Action"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Mixed Reality"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureDatabricks"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Windows Azure Service Management API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["aciapi"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Framework Composer"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Application Insights Configuration Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Smart Alerts"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Virtual Desktop Client"]: Read complete after 0s [id=65c4479b-da09-480b-b23f-0f35f8581838][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Virtual Desktop"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Virtual Desktop"]: Read complete after 1s [id=8b07f2ec-d75e-49d3-be60-c912b74d1fce][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cognitive Search"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cognitive Search"]: Read complete after 0s [id=ee105db8-af26-4ada-be4f-0ad7776c1731][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.SMIT"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Marketplace Caps API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.SMIT"]: Read complete after 0s [id=0a1b7881-a5bb-4424-9ca5-cbc44cfc9a54][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Monitor Control Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Framework Composer"]: Read complete after 1s [id=75ef816d-3185-42f2-9c9b-49f3f33bdab7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Application Insights Configuration Service"]: Read complete after 1s [id=dbf993aa-3c70-4735-a193-700c161ef81d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Windows Azure Service Management API"]: Read complete after 1s [id=94bdd2f9-f9fe-44f5-a337-1d25aac1c3ee][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Smart Alerts"]: Read complete after 1s [id=125699d3-f0a6-4b11-83ff-c56814f10923][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["aciapi"]: Read complete after 1s [id=d4a88a56-3db8-4e02-b330-6fc99aa83a5c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["O365 LinkedIn Connection"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Mixed Reality"]: Read complete after 1s [id=2b905f44-83e6-47f7-a128-9f73e9d7f5b2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzNS EventHub Action"]: Read complete after 1s [id=d302a996-3060-43ce-9b25-321e4536f635][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cosmos DB"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["asmcontainerimagescanner"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["GatewayRP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Virtual Network to Network Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureDatabricks"]: Read complete after 1s [id=98eaa058-0803-4d61-9bc3-bc8e87c134c6][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Service CMEK Prod"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Monitor Control Service"]: Read complete after 0s [id=69ddd04b-2633-4d04-8ec4-8b9bbd194db2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MDC Data Sensitivity"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Services Asset Notification"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Compute Recommendation Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Virtual Network to Network Resource Provider"]: Read complete after 0s [id=e196bad2-c9bf-4195-b2ec-792bc55c88e5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["GatewayRP"]: Read complete after 0s [id=7d4be75d-07a1-455b-a572-1010967ce31f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Data Lake"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Metrics Monitor API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Data Lake"]: Read complete after 1s [id=0eae9694-b150-4c6e-b1cc-0a51e773e9e5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Iot Hub"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Marketplace Caps API"]: Read complete after 1s [id=684bd204-7564-4939-91e3-7f1dade7278f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AML Registries"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Metrics Monitor API"]: Read complete after 1s [id=7638f054-1a6b-43fa-94a6-33a33d868bbf][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AML Registries"]: Read complete after 0s [id=a898ab69-c582-4431-80f6-589b46911fba][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CosmosDB Dedicated Instance"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["O365 LinkedIn Connection"]: Read complete after 1s [id=28b5eef6-cbcd-428e-8f3f-97dd2b4b498f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["asmcontainerimagescanner"]: Read complete after 1s [id=0acd05e1-7d70-4c5f-95e5-0e2084c947c6][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning OpenAI"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MCAPI Authorization Prod"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cosmos DB"]: Read complete after 1s [id=35489b42-0bce-445a-ae61-853f650b8747][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MDC Data Sensitivity"]: Read complete after 1s [id=ff58474f-f39a-446f-bf26-b1c76e6b97c9][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CosmosDB Dedicated Instance"]: Read complete after 0s [id=1fac8298-b332-4d49-8ac6-1b105ac74e8a][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure API Management"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure MFA StrongAuthenticationService"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Compute Recommendation Service"]: Read complete after 1s [id=18bd4271-8a12-4c48-be44-f1714741f4fa][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Operations Management Suite"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Services Asset Notification"]: Read complete after 1s [id=85814b96-3e23-4fd5-8024-5938c2b05597][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CAS API Security RP Staging"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure API Management"]: Read complete after 0s [id=488f9cb6-7698-44ea-b210-93a24a24286d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Service CMEK Prod"]: Read complete after 1s [id=2a7334e8-b58c-4163-a9cf-a9b20587f032][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Office 365 Configure"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Compute"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Iot Hub"]: Read complete after 1s [id=32403cf8-69a3-4f42-835e-bc4f4c4a1e0b][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Compute"]: Read complete after 1s [id=83d8fe96-1397-4fe6-b1f7-99ebaae28998][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Scale Sets - CS2"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Managed Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Resource Provider"]: Read complete after 1s [id=dea0024c-0489-4ab2-8eb0-7632979a9d40][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Policy Insights"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Scale Sets - CS2"]: Read complete after 0s [id=761581bc-96c6-43c2-9259-a1c20da5b0a7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureBackup_WBCM_Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Policy Insights"]: Read complete after 0s [id=651da4b6-57a7-4ed2-bc2c-98f1b9cdc22e][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Remote Desktop"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureBackup_WBCM_Service"]: Read complete after 0s [id=3a9bc14b-8b7e-41a7-8644-11854b3eb2ad][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Databricks Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning"]: Read complete after 1s [id=e3405410-15c5-4435-bcc4-cfbc6e71b2c3][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MCAPI Authorization Prod"]: Read complete after 1s [id=5caafac0-feb6-4a23-83e9-8930418790ae][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning OpenAI"]: Read complete after 1s [id=71f08e11-5d5d-4d0b-847f-64ababe2a4dc][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Key Vault Managed HSM"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Lab Services"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Edge Zones storage backend"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure MFA StrongAuthenticationService"]: Read complete after 1s [id=70f1c9ed-971f-4f2d-9c8b-5609ba88da98][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cost Management XCloud"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Operations Management Suite"]: Read complete after 1s [id=0a53f45a-e85d-4b88-b146-403cf29b0e8d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Signup"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CAS API Security RP Staging"]: Read complete after 1s [id=5919aa7f-2449-4c30-b319-5e3e09ae99d4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Remote Desktop"]: Read complete after 0s [id=83222ac3-dedf-43de-ae3e-25e041496d72][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.Azure.ActiveDirectoryIUX"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Registry Application"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Databricks Resource Provider"]: Read complete after 0s [id=1ae44c17-3038-4464-9c51-6bcb28463935][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["ACR-Tasks-Network"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Office 365 Configure"]: Read complete after 1s [id=9935ecaa-ed97-4e01-82be-6434570d79a4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AvsOnFleetRP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Signup"]: Read complete after 0s [id=819d5ffe-14fe-4b8a-a8fa-87e4cb67a8dd][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Kubernetes Service AAD Server"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.Azure.ActiveDirectoryIUX"]: Read complete after 0s [id=2dbbe902-7677-4712-8854-d205a5fd9df7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Media Services"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["ACR-Tasks-Network"]: Read complete after 0s [id=21907abc-90f3-4d6e-bba5-debfc14947de][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.Relay"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AvsOnFleetRP"]: Read complete after 0s [id=5e30db46-593c-4de9-b870-ffc11a170ff4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Managed Service"]: Read complete after 0s [id=15aaddc0-5116-4664-b677-b58f62bf9832][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Database for PostgreSQL Marlin"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Marketplace Container Management API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Media Services"]: Read complete after 1s [id=da1c9ec9-f94d-45c8-a659-88767a455edb][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.Relay"]: Read complete after 1s [id=8eb0d350-723c-4c77-afe3-50447bf2ac21][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Database for PostgreSQL Marlin"]: Read complete after 1s [id=f8a12f14-c7fa-4b4f-8016-50695f3cc5b6][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.EventGrid"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Management Groups"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Invitation Acceptance Portal"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Management Groups"]: Read complete after 0s [id=ef05d425-2efb-44b9-8020-944c670a5c35][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Stream Analytics"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Invitation Acceptance Portal"]: Read complete after 0s [id=ef02bdec-e7db-4501-859f-220adbf463a1][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.NotificationHubs"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Lab Services"]: Read complete after 1s [id=aca4a3f4-6db7-45ed-826f-b81073f3b8b0][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Storage Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Key Vault Managed HSM"]: Read complete after 1s [id=898c2003-6b36-44c2-8f9c-fc3cd2c2f1a2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Policy Administration Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Edge Zones storage backend"]: Read complete after 1s [id=0dcd363b-15e9-468c-ba14-52e2b07f4062][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Services"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cost Management XCloud"]: Read complete after 1s [id=cdb46460-79e6-44ea-bca5-8a0b2ef8e159][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Windows Azure Active Directory"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Stream Analytics"]: Read complete after 0s [id=a0775f8f-25c1-41eb-90be-2f9f7f3cda30][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureSupportCenter"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Registry Application"]: Read complete after 1s [id=949c27f5-bbe3-46a8-9f56-7c56fe346ad4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.NotificationHubs"]: Read complete after 0s [id=62c7ad04-5b32-4b12-9902-db19af85064a][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Backup NRP Application"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Healthcare APIs Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Kubernetes Service AAD Server"]: Read complete after 1s [id=be093ff8-567a-409e-b25b-4682ee056afa][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure HDInsight Cluster API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureSupportCenter"]: Read complete after 0s [id=5b5ffe21-2031-44b1-8bac-54ce693e129b][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Access IoT Hub Device Provisioning Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Healthcare APIs Resource Provider"]: Read complete after 0s [id=92890611-3b97-4675-9c52-bbb2a3ebf7b5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft App Access Panel"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Marketplace Container Management API"]: Read complete after 1s [id=cceda843-857b-4993-aaeb-490a9bc664ac][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Container Registry"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Access IoT Hub Device Provisioning Service"]: Read complete after 0s [id=edb2f639-73df-4889-b2fd-5f220e8cbd4b][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure HDInsight Surrogate Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft App Access Panel"]: Read complete after 0s [id=1a4c1fdf-875f-4e40-bd15-84cfd20ca724][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzNet Security Guard"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.EventGrid"]: Read complete after 1s [id=2cecc7d7-a553-4d6b-98ba-8983aa3b28a2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Container Registry"]: Read complete after 1s [id=b97d04b8-10df-46e6-8f00-15199caf6ba4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Defender for Cloud Pricing Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Instance Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzNet Security Guard"]: Read complete after 1s [id=57a2e712-ee3e-4355-8ab4-160082b33e9c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure HDInsight Surrogate Service"]: Read complete after 1s [id=b6d9e72b-28cd-4c1e-a2b4-474a60796252][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Bastion"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Database"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Defender for Cloud Pricing Resource Provider"]: Read complete after 0s [id=65b09c85-8e8b-462e-b7a7-e0123bddf326][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Key Vault Managed HSM Key Governance Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Policy Administration Service"]: Read complete after 1s [id=1d990b9b-96dc-464f-a0c6-cd85296aaa36][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure DNS"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Services"]: Read complete after 1s [id=2176885d-08e7-4b83-857b-d698e640822d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Storage Resource Provider"]: Read complete after 1s [id=7fd228df-591e-4ecb-a15d-2cde41621991][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AML Inferencing Frontdoor"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Database Backup To Azure Backup Vault"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Windows Azure Active Directory"]: Read complete after 1s [id=8902b431-db64-48c4-b943-8b986007013a][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Modern Contact Master"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Bastion"]: Read complete after 0s [id=df304054-3cbb-4298-aaa6-2d91521ae5c8][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Database"]: Read complete after 0s [id=740af806-735e-42f1-abe3-329a3ff58bab][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Search Management"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure ESTS Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Key Vault Managed HSM Key Governance Service"]: Read complete after 0s [id=be8b37dc-50f9-40d3-8eeb-41ba9e88fb63][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure VMware Solution RP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure HDInsight Cluster API"]: Read complete after 1s [id=59f86e89-2088-40ab-a909-182366a3781c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Resource Graph"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Search Management"]: Read complete after 0s [id=420a8c42-5480-4185-9eba-9cc7efcc2798][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure ESTS Service"]: Read complete after 0s [id=12e25f54-581b-4b3b-a82e-c77c10155ba2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Backup NRP Application"]: Read complete after 1s [id=5513e1e8-734b-48c9-82bd-319d0fd30328][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cosmos DB Virtual Network To Network Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["TerrAHCOF"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Domain-Management"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure VMware Solution RP"]: Read complete after 0s [id=d2fbb221-ec5a-4454-a39b-feff73d453ac][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Advisor"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Resource Graph"]: Read complete after 0s [id=0b6f5a54-5b5c-4c6d-bda7-9819f86a18e9][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Dynamic Alerts"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["TerrAHCOF"]: Read complete after 0s [id=9f56864b-9e64-4857-a7c7-53a8efa6c067][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Domain-Management"]: Read complete after 0s [id=482a3945-5935-428f-9abb-6e9dd45b0bed][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Managed Service Identity"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cost Management Scheduled Actions"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Advisor"]: Read complete after 0s [id=7ad647aa-a5a4-4863-bcc1-c54880454307][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Diagnostic Services Trusted Storage Access"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Dynamic Alerts"]: Read complete after 0s [id=cbe69e00-8022-410d-93e2-632fc8f97940][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Managed Disks Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Managed Service Identity"]: Read complete after 0s [id=1f3032de-9f15-4de9-947d-a6097b1c55a7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cost Management Scheduled Actions"]: Read complete after 0s [id=6713dc03-07a0-48d4-81cd-49da2b7c6e95][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Analysis Services"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Instance Service"]: Read complete after 1s [id=88d43bae-dcb2-4a69-adbc-e13adcb7a945][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Key Vault"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Traffic Manager and DNS"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Diagnostic Services Trusted Storage Access"]: Read complete after 1s [id=303ec706-53f0-49ca-84ce-45c03ee5cb67][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["WindowsDefenderATP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Analysis Services"]: Read complete after 0s [id=62cfef1d-25da-420e-a088-6e40b3f72129][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Security Insights"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AML Inferencing Frontdoor"]: Read complete after 1s [id=ac1b5c33-3add-471e-936d-80dfc49f7b11][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Database Backup To Azure Backup Vault"]: Read complete after 1s [id=fd770d06-c32f-440f-afca-259a2122a7b9][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureDnsFrontendApp"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Traffic Manager and DNS"]: Read complete after 0s [id=7cc0c537-9418-4966-90cd-4c0b216baf95][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Compute Artifacts Publishing Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Data Migration Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Modern Contact Master"]: Read complete after 1s [id=2cd14265-fb91-4cef-9813-12f30101c0f5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Singularity"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure DNS"]: Read complete after 1s [id=27caf37d-f6c6-41ea-9dc4-0081e72c957d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["WindowsDefenderATP"]: Read complete after 0s [id=f6227e1a-5d5e-452b-993c-5d2f0e4aeb11][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Managed Instance to Azure AD Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Portal"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Security Insights"]: Read complete after 0s [id=6410e1ad-c4c3-4a2a-a311-2d6bf2f945a4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureDnsFrontendApp"]: Read complete after 0s [id=5fd81d91-c6ab-4ea5-af91-e6a625f794ef][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Service Runtime Auth"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Monitor Restricted"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Managed Instance to Azure AD Resource Provider"]: Read complete after 0s [id=e1ae8d74-9d90-4bb0-981c-947cea7813f2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Meru19 MySQL First Party App"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Cosmos DB Virtual Network To Network Resource Provider"]: Read complete after 1s [id=3001292a-aacd-4353-9c16-1a019dfa4eb1][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Networking-MNC"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Service Runtime Auth"]: Read complete after 0s [id=402c6259-36e2-49d9-9529-d75920e79a6f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Monitor Restricted"]: Read complete after 0s [id=c4ef8503-3560-440f-ae19-05bb2f67b100][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["OneProfile Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AADReporting"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Meru19 MySQL First Party App"]: Read complete after 0s [id=2d811ba8-c0f4-4d47-a730-9abc2f1a3158][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Log Analytics API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["OneProfile Service"]: Read complete after 0s [id=f422914c-f5f0-4768-b308-c09e21ff48b5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Data Explorer"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AADReporting"]: Read complete after 0s [id=1eccd015-20ce-4090-95e4-3c3ca66167b8][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Jarvis Transaction Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Log Analytics API"]: Read complete after 0s [id=e9874d3c-f1fb-40c1-b891-f324534d68b2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Graph"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Key Vault"]: Read complete after 0s [id=9613ffb1-6681-40f1-ae74-02ef9bd84a5c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Managed Instance to Microsoft.Network"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Jarvis Transaction Service"]: Read complete after 1s [id=22e26660-bbce-4f34-b960-5220de362765][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Managed Disks Resource Provider"]: Read complete after 2s [id=197c26ed-2ff3-458e-980b-db6fe92dd765][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Data Explorer"]: Read complete after 1s [id=abee169c-b2f4-402f-9bc3-4ccc6dc51b6c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Threat Protection"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Defender for Cloud Scanner Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Billing RP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure SQL Managed Instance to Microsoft.Network"]: Read complete after 1s [id=23e25b46-c0a3-4636-95b8-e2114bddaff1][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure HDInsight Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Data Migration Service"]: Read complete after 1s [id=85b327b8-163b-4727-9ce3-1184208bc582][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Network Watcher"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Compute Artifacts Publishing Service"]: Read complete after 1s [id=fa104478-c9ec-4366-b007-f304a21a7f31][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Time Series Insights"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Singularity"]: Read complete after 1s [id=a302e71a-970d-4c03-bc9e-206223e6b328][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure API for DICOM"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Portal"]: Read complete after 1s [id=ee7da987-0288-4835-9de6-c71e34251248][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Cloud Infrastructure Entitlement Management"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Defender for Cloud Scanner Resource Provider"]: Read complete after 0s [id=5d48c1b6-0d80-401b-8c6b-bc4e9d4ac247][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Threat Protection"]: Read complete after 0s [id=9c6d77ed-471a-4a1e-929d-da581602ae58][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Billing RP"]: Read complete after 0s [id=864c32fb-720c-40df-afa2-9e426470b968][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Registry"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Apps Domain-Management Dogfood"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Hyper-V Recovery Manager"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure HDInsight Service"]: Read complete after 0s [id=a7e75fce-352a-4d8e-87e7-1c68fa73467f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Afdx Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Networking-MNC"]: Read complete after 1s [id=103af5b1-e595-4ad0-932e-4ee1f89946b3][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Log Search Alerts"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Cloud Infrastructure Entitlement Management"]: Read complete after 0s [id=b8c59dbc-75ba-4450-855d-6d14458c7ae7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Approval Management"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Hyper-V Recovery Manager"]: Read complete after 0s [id=9bdf39e0-dc76-47ce-9b20-f0be51f633ca][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.ServiceBus"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Apps Domain-Management Dogfood"]: Read complete after 0s [id=a19ef2bd-2f16-452e-bcc0-e83fe2141b56][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Windows VM Sign-In"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Afdx Resource Provider"]: Read complete after 0s [id=5104f0ab-20f5-4bf2-a271-560090c28f1d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CAS API Security RP Dev"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.ServiceBus"]: Read complete after 0s [id=f2eda65a-1270-4046-8a53-f31ac3838fee][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Windows VM Sign-In"]: Read complete after 0s [id=e1fe5e04-832f-4d02-9bab-a9493fa8e5eb][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Service Fabric Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureBackup_Fabric_Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CAS API Security RP Dev"]: Read complete after 0s [id=972eddfc-785d-472c-9002-00c798be52ea][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Policy Insights Provider Data Plane"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Service Fabric Resource Provider"]: Read complete after 0s [id=4933ae43-b60e-4aa0-9392-7c33f31683d2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Service Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureBackup_Fabric_Service"]: Read complete after 0s [id=4a7bf61f-1381-4152-8e34-afb2e9367648][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Signup Portal"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Graph"]: Read complete after 1s [id=d67f1348-3947-4a13-bcc8-2b4cc5484ec7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Meru19 First Party App"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Policy Insights Provider Data Plane"]: Read complete after 0s [id=39798479-0cbe-45fe-8c8e-2bba24e5f522][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureBackupReporting"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Time Series Insights"]: Read complete after 1s [id=79b1e2fd-89e7-4c81-a4d2-8a2a822683b5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["ACR-Tasks-Prod"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Signup Portal"]: Read complete after 1s [id=6b0ad913-1aee-4b50-b280-d95b213a993d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Network Watcher"]: Read complete after 1s [id=3cceb603-35e7-4b34-b444-e8582b39da3f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Healthcare APIs"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["PTSS"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure API for DICOM"]: Read complete after 1s [id=ff224c0d-441b-4c6d-bbf6-a8071d016009][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Service Resource Provider"]: Read complete after 1s [id=13cc4c1e-07ae-4b4e-8cb9-c6e6daf44554][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Application Insights API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Container Apps - Data Plane"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Meru19 First Party App"]: Read complete after 1s [id=9399e613-5e97-4a38-86f8-71d7bef7f7f4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Registry"]: Read complete after 1s [id=f6a519b4-87d8-44e4-9310-1efb4706d436][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Logic Apps"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Defender for Cloud Servers Scanner Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureBackupReporting"]: Read complete after 0s [id=93c6feb0-3095-441a-9bd2-235e05c19f78][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureContainerService"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Application Insights API"]: Read complete after 0s [id=60e3e4b5-4cb6-4e95-80ee-f50ada47f2cf][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Log Search Alerts"]: Read complete after 1s [id=70546a6e-df2f-4df6-8497-1239fbab909f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Service Bus MSI App"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Monitor System"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Approval Management"]: Read complete after 1s [id=d76964f6-a648-434e-bf51-9cfb6bf511cc][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Healthcare APIs"]: Read complete after 0s [id=0ff786e0-96b1-4ad1-8a68-fab8fb5d24ee][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Hilo Client"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure App Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Defender for Cloud Servers Scanner Resource Provider"]: Read complete after 0s [id=cad27e99-e101-4db8-8e62-c347ab23ea4b][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Maps"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureContainerService"]: Read complete after 0s [id=d0de670a-50ea-4172-8a8f-dcb65d488b41][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Virtual Desktop ARM Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Monitor System"]: Read complete after 0s [id=3defea71-000a-49f2-bc86-f5c886b6f126][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Event Hub MSI App"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Hilo Client"]: Read complete after 0s [id=a565d298-39b6-45a8-b7c5-b438d19ffc51][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure OSSRDBMS MySQL Flexible Server BYOK"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Maps"]: Read complete after 0s [id=b0fa92d1-c412-4aa9-8696-39ebcf484aad][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Backup Management Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Virtual Desktop ARM Provider"]: Read complete after 0s [id=f5d006df-f455-467e-ad7e-da6a0bf70f61][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft B2B Admin Worker"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Event Hub MSI App"]: Read complete after 0s [id=fc6b0ea6-eb02-41e8-8521-9b745413b9d2][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MicrosoftAzureRedisCache"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure OSSRDBMS MySQL Flexible Server BYOK"]: Read complete after 0s [id=1874119f-c12e-4748-a81f-3a924ab861af][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Authorization App 1"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Backup Management Service"]: Read complete after 0s [id=c379997e-8367-46c9-bc95-87b3c31c1664][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Registry - Dataplane"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft B2B Admin Worker"]: Read complete after 0s [id=0d4a0506-12de-4c1b-867c-6a9957898170][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Compute Usage Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MicrosoftAzureRedisCache"]: Read complete after 0s [id=3fd34229-6efa-4f65-a952-ddf19267df95][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["ASA Curation Web Tool"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Authorization App 1"]: Read complete after 0s [id=5a4ea333-8a8d-4e79-a323-7c7c467c0670][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["NFV Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["ACR-Tasks-Prod"]: Read complete after 0s [id=6d2d5e6e-23ce-4cba-afdc-c011cda7853b][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Credential Configuration Endpoint Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Container Registry - Dataplane"]: Read complete after 0s [id=9e83b40e-7d5a-414f-afaf-f9b1d301510f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Iot Hub Publisher App"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["PTSS"]: Read complete after 0s [id=229e1dea-5f17-4113-84bd-5142dbbabff7][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CAS API Security RP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Compute Usage Provider"]: Read complete after 0s [id=94f6d697-0bf4-4470-bebb-fcd2199c9b52][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MDATPNetworkScanAgent"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Container Apps - Data Plane"]: Read complete after 1s [id=0ead49dc-20ee-4d1a-9106-fc9710f5432d][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Healthcare APIs RBAC"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["ASA Curation Web Tool"]: Read complete after 1s [id=278608f5-524e-4f4b-9cba-f295d7ee21d9][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Graph Change Tracking"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Logic Apps"]: Read complete after 1s [id=f52afadd-1eab-4ba1-92e2-2681065a6842][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["NFV Resource Provider"]: Read complete after 1s [id=bbbd254c-7bb2-4b10-89e2-cd764560d79c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure App Service"]: Read complete after 1s [id=45670229-0d02-4c8f-8b81-8fe3e4efc77b][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MDATPNetworkScanAgent"]: Read complete after 1s [id=80eeabd2-8c77-453c-bc57-b1ba04ecbcb0][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Service Bus MSI App"]: Read complete after 1s [id=1466ddb9-5e96-4d09-9bf1-b17a6ebfd3a5][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Iot Hub Publisher App"]: Read complete after 1s [id=3c5fcba0-6b2e-4f47-9110-9ad67f5d7b41][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Windows Azure Security Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Linux VM Sign-In"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure OSSRDBMS PostgreSQL Flexible Server AAD Authentication"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Edge Zones storage"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.CustomProviders RP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Service Token Store"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Graph Change Tracking"]: Read complete after 0s [id=99bf7cb6-8c90-4fb3-b0c6-0028af61118a][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Cognitive Services"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Linux VM Sign-In"]: Read complete after 0s [id=ee86b5dc-aa7c-4532-a583-014403082d9f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Windows Azure Security Resource Provider"]: Read complete after 0s [id=cb58a622-79cc-41cd-bc2e-199f8beb73d4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azns AAD Webhook"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Maps Resource Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Service Token Store"]: Read complete after 0s [id=f65d912c-7ea7-434e-a93e-b285a0aaca54][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.CustomProviders RP"]: Read complete after 0s [id=caac9a46-e2a0-4086-b25d-bfe7f8e3dd00][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Managed HSM RP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["IAM Supportability"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Cognitive Services"]: Read complete after 0s [id=c3758efe-cdd6-41e0-b424-de9ec10a899e][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureAutomation"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azns AAD Webhook"]: Read complete after 0s [id=2be2c54a-562d-4899-94ee-0b1dc57d8676][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Power BI Premium"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Managed HSM RP"]: Read complete after 0s [id=6c81807a-ed61-49cb-872e-e5f29a898204][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["NetworkTrafficAnalyticsService"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AzureAutomation"]: Read complete after 0s [id=ef9a9c07-818f-4bc8-875f-91cfc753d5cb][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Blueprints"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Power BI Premium"]: Read complete after 0s [id=c5b7bc53-e49d-4502-9a57-ce998ef46995][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Support - Network Watcher"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CAS API Security RP"]: Read complete after 1s [id=3596ab11-3fbb-48a9-aaa8-7319ce12ce13][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Geneva Alert RP"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Healthcare APIs RBAC"]: Read complete after 0s [id=216582de-0dac-467f-b3dd-c8cc80994526][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Notification Service"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["NetworkTrafficAnalyticsService"]: Read complete after 0s [id=4c9859c6-cb03-46fc-9960-5b46099d32e8][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure DNS Managed Resolver"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Credential Configuration Endpoint Service"]: Read complete after 2s [id=7724840b-67c0-4c3d-bb99-61e43fc2c95a][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Common Job Provider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Blueprints"]: Read complete after 1s [id=ba3a364f-7977-4620-ac6d-3702e8cf6bc8][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Container Apps - Control Plane"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Support - Network Watcher"]: Read complete after 1s [id=3fe7b347-b83b-4966-a12f-df1115c0a91e][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.EventHubs"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure DNS Managed Resolver"]: Read complete after 1s [id=494e4333-88b1-4df5-ba69-e4a4a6d75f1c][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Data Warehouse Polybase"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Edge Zones storage"]: Read complete after 1s [id=427aaf2f-c57e-4203-9d37-91ac0879e31e][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Authorization App 2"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft Azure Container Apps - Control Plane"]: Read complete after 0s [id=9207acdb-4a31-40ab-98b8-a4a50047e207][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure OSSRDBMS PostgreSQL Flexible Server AAD Authentication"]: Read complete after 1s [id=5ed81e6b-25a5-49ca-b046-84bab08c06ce][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MicrosoftGuestConfiguration"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["EventGrid Data API"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Data Warehouse Polybase"]: Read complete after 0s [id=2596c7ad-fc53-48ab-a434-63c7938c09e8][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AAD Request Verification Service - PROD"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Maps Resource Provider"]: Read complete after 1s [id=5c87b736-ee83-4039-8a84-dc380246cf28][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Microsoft.EventHubs"]: Read complete after 0s [id=ace0407b-2fb1-4b3b-ba0b-2514ef252ea9][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Storage"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["IAM Supportability"]: Read complete after 1s [id=136cc6c3-23f4-4c75-9fa9-361f53116d56][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MaintenanceResourceProvider"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["EventGrid Data API"]: Read complete after 0s [id=adfde6cf-d334-453d-8dfc-b72f26a60460][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Marketplace Integration"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CCM TAGS"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["AAD Request Verification Service - PROD"]: Read complete after 0s [id=3b3beb72-c81f-44e3-8f0c-93b44a3b6f71][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Framework Dev Portal"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MaintenanceResourceProvider"]: Read complete after 0s [id=bda5f43c-110e-471a-bd69-dbfa369a7020][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud Marketplace Integration"]: Read complete after 0s [id=58d2ae2e-8e8d-49b6-99e7-e9ad4ae0b6dc][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Regional Service Manager"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure OSSRDBMS Database"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["CCM TAGS"]: Read complete after 0s [id=60375d1d-ba16-4aec-81e4-546be6583eb4][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud DiagSettings App"]: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Bot Framework Dev Portal"]: Read complete after 0s [id=e30def77-1201-4052-9c89-0535778d5d3f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azurerm_subscription.primary: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Notification Service"]: Read complete after 1s [id=31037775-b8e5-472a-b82a-abb570eeaf90][0m
[0m[1mmodule.management_group.module.management_group.data.azurerm_subscriptions.available: Reading...[0m[0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Regional Service Manager"]: Read complete after 0s [id=6a901e31-e804-4208-83a0-97df57533c73][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Spring Cloud DiagSettings App"]: Read complete after 0s [id=457b6ee5-caea-4443-a220-3f35ac6b25f3][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure OSSRDBMS Database"]: Read complete after 0s [id=0ecc756a-6d33-4aca-bacf-2d672ab43e79][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/e76c65cf-2dd0-4863-b1bd-b22c7115ac7f][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Geneva Alert RP"]: Read complete after 1s [id=3c8ef280-9361-4802-b624-b198e21f0895][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Common Job Provider"]: Read complete after 1s [id=d7920767-793a-4e46-bc2e-e6cd98b31d64][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Machine Learning Authorization App 2"]: Read complete after 1s [id=40c3c711-ef5b-4b38-a839-b11880150106][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["MicrosoftGuestConfiguration"]: Read complete after 1s [id=b167452a-dedb-41cf-8cc4-fa0ea6396eb6][0m
[0m[1mmodule.resource_groups.module.resource_groups.data.azuread_service_principal.current_service_principals["Azure Storage"]: Read complete after 1s [id=b18a2705-852f-4d3f-b279-88a57adbfe60][0m
[0m[1mmodule.management_group.module.management_group.data.azurerm_subscriptions.available: Read complete after 3s [id=subscriptions-6603f62a-2c40-4809-8acb-bd99553cc6ab][0m
[0m[1mmodule.management_group.module.management_group.data.azurerm_subscription.current_subscriptions["TerrAHCOF"]: Reading...[0m[0m
[0m[1mmodule.management_group.module.management_group.data.azurerm_subscription.current_subscriptions["TerrAHCOF"]: Read complete after 0s [id=/subscriptions/e76c65cf-2dd0-4863-b1bd-b22c7115ac7f][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.management_group.module.management_group.azurerm_management_group.level_1["/providers/Microsoft.Management/managementGroups/mg_global"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_1" {
      [32m+[0m[0m display_name               = "Global"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_global"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/6603f62a-2c40-4809-8acb-bd99553cc6ab"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "canary-Level 2A"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_2a"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2b"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "canary-Level 2B"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_2b"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2c"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "canary-Level 2C"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_2c"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/canary_mg_level_2d"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "canary-Level 2D"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_2d"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2a"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "Level 2A"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_2a"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2b"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "Level 2B"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_2b"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2c"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "Level 2C"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_2c"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/mg_level_2d"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_2" {
      [32m+[0m[0m display_name               = "Level 2D"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_2d"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/canary_mg_level_3a"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_3" {
      [32m+[0m[0m display_name               = "canary-Level 3A"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_3a"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/canary_mg_level_3b"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_3" {
      [32m+[0m[0m display_name               = "canary-Level 3B"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_3b"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/canary_mg_level_3c"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_3" {
      [32m+[0m[0m display_name               = "canary-Level 3C"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_3c"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_2a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/mg_level_3a"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_3" {
      [32m+[0m[0m display_name               = "Level 3A"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_3a"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_2a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/mg_level_3b"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_3" {
      [32m+[0m[0m display_name               = "Level 3B"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_3b"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_2a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/mg_level_3c"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_3" {
      [32m+[0m[0m display_name               = "Level 3C"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_3c"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_2a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/canary_mg_level_4a"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_4" {
      [32m+[0m[0m display_name               = "canary-Level 4A"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_4a"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_3a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/canary_mg_level_4b"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_4" {
      [32m+[0m[0m display_name               = "canary-Level 4B"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_4b"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_3a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/canary_mg_level_4c"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_4" {
      [32m+[0m[0m display_name               = "canary-Level 4C"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "canary_mg_level_4c"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/canary_mg_level_3b"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/mg_level_4a"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_4" {
      [32m+[0m[0m display_name               = "Level 4A"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_4a"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_3a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/mg_level_4b"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_4" {
      [32m+[0m[0m display_name               = "Level 4B"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_4b"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_3a"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.management_group.module.management_group.azurerm_management_group.level_4["/providers/Microsoft.Management/managementGroups/mg_level_4c"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group" "level_4" {
      [32m+[0m[0m display_name               = "Level 4C"
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m name                       = "mg_level_4c"
      [32m+[0m[0m parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg_level_3b"
      [32m+[0m[0m subscription_ids           = (known after apply)
    }

[1m  # module.policy_assignments.module.policy_assignments.azurerm_management_group_policy_assignment.policy_assignment["nzism_built_in"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group_policy_assignment" "policy_assignment" {
      [32m+[0m[0m description          = "Assignment of the built in NZISM initiative to management group"
      [32m+[0m[0m display_name         = "nzism_built_in"
      [32m+[0m[0m enforce              = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m location             = "australiaeast"
      [32m+[0m[0m management_group_id  = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m metadata             = (known after apply)
      [32m+[0m[0m name                 = "nzism_built_in"
      [32m+[0m[0m not_scopes           = []
      [32m+[0m[0m parameters           = jsonencode(
            {
              [32m+[0m[0m effect-1e66c121-a66a-4b1f-9b83-0fd99bf0fc2d = {
                  [32m+[0m[0m value = "Audit"
                }
            }
        )
      [32m+[0m[0m policy_definition_id = "/providers/Microsoft.Authorization/policySetDefinitions/93d2179e-3068-c82f-2428-d614ae836a04"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.policy_assignments.module.policy_assignments.azurerm_management_group_policy_assignment.policy_assignment["tag_governance"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_management_group_policy_assignment" "policy_assignment" {
      [32m+[0m[0m description          = "Assignment of the custom tagging policies"
      [32m+[0m[0m display_name         = "tag_governance"
      [32m+[0m[0m enforce              = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m location             = "australiaeast"
      [32m+[0m[0m management_group_id  = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m metadata             = (known after apply)
      [32m+[0m[0m name                 = "tag_governance"
      [32m+[0m[0m not_scopes           = []
      [32m+[0m[0m policy_definition_id = "/providers/Microsoft.Management/managementGroups/mg_global/providers/Microsoft.Authorization/policySetDefinitions/tag_governance"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.resource_groups.module.resource_groups.azurerm_resource_group.resource_groups["TestRG"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_groups" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australiaeast"
      [32m+[0m[0m name     = "TestRG"
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Environment" = "DEV"
          [32m+[0m[0m "ServiceName" = "TerrAHCOF"
        }
    }

[1m  # module.resource_groups.module.resource_groups.azurerm_storage_container.storage_container["TerrAHCOF"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type   = "private"
      [32m+[0m[0m has_immutability_policy = (known after apply)
      [32m+[0m[0m has_legal_hold          = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m metadata                = (known after apply)
      [32m+[0m[0m name                    = "terrahcoftfstate"
      [32m+[0m[0m resource_manager_id     = (known after apply)
      [32m+[0m[0m storage_account_name    = "stterrahcofstateae"
    }

[1m  # module.state_file_management.module.state_file_management.azurerm_storage_account.state_file_storage_accounts["BAU"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "state_file_storage_accounts" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = "StorageV2"
      [32m+[0m[0m account_replication_type          = "GRS"
      [32m+[0m[0m account_tier                      = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public   = true
      [32m+[0m[0m cross_tenant_replication_enabled  = true
      [32m+[0m[0m default_to_oauth_authentication   = false
      [32m+[0m[0m enable_https_traffic_only         = true
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = false
      [32m+[0m[0m is_hns_enabled                    = false
      [32m+[0m[0m large_file_share_enabled          = (known after apply)
      [32m+[0m[0m location                          = "australiaeast"
      [32m+[0m[0m min_tls_version                   = "TLS1_2"
      [32m+[0m[0m name                              = "stbaubauaedev"
      [32m+[0m[0m nfsv3_enabled                     = false
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m public_network_access_enabled     = true
      [32m+[0m[0m queue_encryption_key_type         = "Service"
      [32m+[0m[0m resource_group_name               = "rg-terraformstate-ae"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m sftp_enabled                      = false
      [32m+[0m[0m shared_access_key_enabled         = true
      [32m+[0m[0m table_encryption_key_type         = "Service"
    }

[1m  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.inheritTagValuesFromRG[0m will be created
[0m  [32m+[0m[0m resource "azurerm_policy_definition" "inheritTagValuesFromRG" {
      [32m+[0m[0m description         = "Adds the mandatory tags with its value from the parent resource group when any resource missing this tag is created or updated. Existing resources can be remediated by triggering a remediation task. If the tags exists with a different value it will not be changed."
      [32m+[0m[0m display_name        = "Inherit tag values from the resource group"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m metadata            = <<-EOT
            {
                "category": "Tag Governance",
                "version" : "1.0.0"
                }
        EOT
      [32m+[0m[0m mode                = "Indexed"
      [32m+[0m[0m name                = "inheritTagValuesFromRG"
      [32m+[0m[0m parameters          = jsonencode(
            {
              [32m+[0m[0m Environment = {
                  [32m+[0m[0m defaultValue = "Environment"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag Environment."
                      [32m+[0m[0m displayName = "Require tag Environment on a resource groups"
                    }
                  [32m+[0m[0m type         = "String"
                }
              [32m+[0m[0m ServiceName = {
                  [32m+[0m[0m defaultValue = "ServiceName"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag ServiceName."
                      [32m+[0m[0m displayName = "Require tag ServiceName on a resource groups"
                    }
                  [32m+[0m[0m type         = "String"
                }
            }
        )
      [32m+[0m[0m policy_rule         = jsonencode(
            {
              [32m+[0m[0m if   = {
                  [32m+[0m[0m anyOf = [
                      [32m+[0m[0m {
                          [32m+[0m[0m notEquals = ""
                          [32m+[0m[0m value     = "[resourceGroup().tags[parameters('ServiceName')]]"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m notEquals = ""
                          [32m+[0m[0m value     = "[resourceGroup().tags[parameters('Environment')]]"
                        },
                    ]
                }
              [32m+[0m[0m then = {
                  [32m+[0m[0m details = {
                      [32m+[0m[0m operations        = [
                          [32m+[0m[0m {
                              [32m+[0m[0m field     = "[concat('tags[', parameters('ServiceName'), ']')]"
                              [32m+[0m[0m operation = "add"
                              [32m+[0m[0m value     = "[resourceGroup().tags[parameters('ServiceName')]]"
                            },
                          [32m+[0m[0m {
                              [32m+[0m[0m field     = "[concat('tags[', parameters('Environment'), ']')]"
                              [32m+[0m[0m operation = "add"
                              [32m+[0m[0m value     = "[resourceGroup().tags[parameters('Environment')]]"
                            },
                        ]
                      [32m+[0m[0m roleDefinitionIds = [
                          [32m+[0m[0m "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c",
                        ]
                    }
                  [32m+[0m[0m effect  = "modify"
                }
            }
        )
      [32m+[0m[0m policy_type         = "Custom"
      [32m+[0m[0m role_definition_ids = (known after apply)
    }

[1m  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.inheritTagsFromRG[0m will be created
[0m  [32m+[0m[0m resource "azurerm_policy_definition" "inheritTagsFromRG" {
      [32m+[0m[0m description         = "Adds the mandatory tags from the parent resource group when any resource missing this tag is created or updated. Existing resources can be remediated by triggering a remediation task. If the tags exists with a different value it will not be changed."
      [32m+[0m[0m display_name        = "Inherit tags from the resource group"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m metadata            = <<-EOT
            {
                "category": "Tag Governance",
                "version" : "1.0.0"
                }
        EOT
      [32m+[0m[0m mode                = "Indexed"
      [32m+[0m[0m name                = "inheritTagsFromRG"
      [32m+[0m[0m parameters          = jsonencode(
            {
              [32m+[0m[0m Environment = {
                  [32m+[0m[0m defaultValue = "Environment"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag Environment."
                      [32m+[0m[0m displayName = "Require tag Environment on a resource groups"
                    }
                  [32m+[0m[0m type         = "String"
                }
              [32m+[0m[0m ServiceName = {
                  [32m+[0m[0m defaultValue = "ServiceName"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag ServiceName."
                      [32m+[0m[0m displayName = "Require tag ServiceName on a resource groups"
                    }
                  [32m+[0m[0m type         = "String"
                }
            }
        )
      [32m+[0m[0m policy_rule         = jsonencode(
            {
              [32m+[0m[0m if   = {
                  [32m+[0m[0m anyOf = [
                      [32m+[0m[0m {
                          [32m+[0m[0m exists = "false"
                          [32m+[0m[0m field  = "[concat('tags[', parameters('ServiceName'), ']')]"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m exists = "false"
                          [32m+[0m[0m field  = "[concat('tags[', parameters('Environment'), ']')]"
                        },
                    ]
                }
              [32m+[0m[0m then = {
                  [32m+[0m[0m details = {
                      [32m+[0m[0m operations        = [
                          [32m+[0m[0m {
                              [32m+[0m[0m field     = "[concat('tags[', parameters('ServiceName'), ']')]"
                              [32m+[0m[0m operation = "add"
                              [32m+[0m[0m value     = "[resourceGroup().tags[parameters('ServiceName')]]"
                            },
                          [32m+[0m[0m {
                              [32m+[0m[0m field     = "[concat('tags[', parameters('Environment'), ']')]"
                              [32m+[0m[0m operation = "add"
                              [32m+[0m[0m value     = "[resourceGroup().tags[parameters('Environment')]]"
                            },
                        ]
                      [32m+[0m[0m roleDefinitionIds = [
                          [32m+[0m[0m "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c",
                        ]
                    }
                  [32m+[0m[0m effect  = "modify"
                }
            }
        )
      [32m+[0m[0m policy_type         = "Custom"
      [32m+[0m[0m role_definition_ids = (known after apply)
    }

[1m  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.requireTagsOnRG[0m will be created
[0m  [32m+[0m[0m resource "azurerm_policy_definition" "requireTagsOnRG" {
      [32m+[0m[0m description         = "Enforces existence of tags on resource groups."
      [32m+[0m[0m display_name        = "Require tags on resource groups"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m metadata            = <<-EOT
            {
                "category": "Tag Governance",
                "version" : "1.0.0"
                }
        EOT
      [32m+[0m[0m mode                = "All"
      [32m+[0m[0m name                = "requireTagsOnRG"
      [32m+[0m[0m parameters          = jsonencode(
            {
              [32m+[0m[0m Environment = {
                  [32m+[0m[0m defaultValue = "Environment"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag Environment."
                      [32m+[0m[0m displayName = "Require tag Environment on a resource groups"
                    }
                  [32m+[0m[0m type         = "String"
                }
              [32m+[0m[0m ServiceName = {
                  [32m+[0m[0m defaultValue = "ServiceName"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag ServiceName."
                      [32m+[0m[0m displayName = "Require tag ServiceName on a resource groups"
                    }
                  [32m+[0m[0m type         = "String"
                }
              [32m+[0m[0m effect      = {
                  [32m+[0m[0m defaultValue = "Deny"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Enable or disable the execution of the policy."
                      [32m+[0m[0m displayName = "Effect"
                    }
                  [32m+[0m[0m type         = "String"
                }
            }
        )
      [32m+[0m[0m policy_rule         = jsonencode(
            {
              [32m+[0m[0m if   = {
                  [32m+[0m[0m allOf = [
                      [32m+[0m[0m {
                          [32m+[0m[0m equals = "Microsoft.Resources/subscriptions/resourceGroups"
                          [32m+[0m[0m field  = "type"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m anyOf = [
                              [32m+[0m[0m {
                                  [32m+[0m[0m exists = "false"
                                  [32m+[0m[0m field  = "[concat('tags[', parameters('ServiceName'), ']')]"
                                },
                              [32m+[0m[0m {
                                  [32m+[0m[0m exists = "false"
                                  [32m+[0m[0m field  = "[concat('tags[', parameters('Environment'), ']')]"
                                },
                            ]
                        },
                    ]
                }
              [32m+[0m[0m then = {
                  [32m+[0m[0m effect = "[parameters('effect')]"
                }
            }
        )
      [32m+[0m[0m policy_type         = "Custom"
      [32m+[0m[0m role_definition_ids = (known after apply)
    }

[1m  # module.tagging_policy_definitions.module.tagging_policy_definitions.azurerm_policy_definition.tagsWithValueRules[0m will be created
[0m  [32m+[0m[0m resource "azurerm_policy_definition" "tagsWithValueRules" {
      [32m+[0m[0m description         = "Enforces that the specified mandatory tags are not allowed specific values."
      [32m+[0m[0m display_name        = "Mandatory tags with Value rules"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m management_group_id = "/providers/Microsoft.Management/managementGroups/mg_global"
      [32m+[0m[0m metadata            = <<-EOT
            {
                "category": "Tag Governance",
                "version" : "1.0.0"
                }
        EOT
      [32m+[0m[0m mode                = "All"
      [32m+[0m[0m name                = "tagsWithValueRules"
      [32m+[0m[0m parameters          = jsonencode(
            {
              [32m+[0m[0m ServiceName      = {
                  [32m+[0m[0m defaultValue = "ServiceName"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Name of the mandatory tag ServiceName."
                      [32m+[0m[0m displayName = "Mandatory tag ServiceName"
                    }
                  [32m+[0m[0m type         = "String"
                }
              [32m+[0m[0m effect           = {
                  [32m+[0m[0m defaultValue = "Deny"
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "Enable or disable the execution of the policy."
                      [32m+[0m[0m displayName = "Effect"
                    }
                  [32m+[0m[0m type         = "String"
                }
              [32m+[0m[0m notAllowedValues = {
                  [32m+[0m[0m defaultValue = [
                      [32m+[0m[0m "",
                      [32m+[0m[0m "NA",
                      [32m+[0m[0m "N/A",
                      [32m+[0m[0m "tbc",
                      [32m+[0m[0m "'tbc'",
                      [32m+[0m[0m "TBC",
                      [32m+[0m[0m "to_be_confirmed",
                      [32m+[0m[0m "to be confirmed",
                    ]
                  [32m+[0m[0m metadata     = {
                      [32m+[0m[0m description = "A list of tag values that are not acceptable for tags"
                      [32m+[0m[0m displayName = "Tag values not allowed for tags"
                    }
                  [32m+[0m[0m type         = "Array"
                }
            }
        )
      [32m+[0m[0m policy_rule         = jsonencode(
            {
              [32m+[0m[0m if   = {
                  [32m+[0m[0m allOf = [
                      [32m+[0m[0m {
                          [32m+[0m[0m equals = "Microsoft.Resources/subscriptions/resourceGroups"
                          [32m+[0m[0m field  = "type"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m anyOf = [
                              [32m+[0m[0m {
                                  [32m+[0m[0m field = "[concat('tags[', parameters('ServiceName'), ']')]"
                                  [32m+[0m[0m in    = "[parameters('notAllowedValues')]"
                                },
                            ]
                        },
                    ]
                }
              [32m+[0m[0m then = {
                  [32m+[0m[0m effect = "[parameters('effect')]"
                }
            }
        )
      [32m+[0m[0m policy_type         = "Custom"
      [32m+[0m[0m role_definition_ids = (known after apply)
    }

[1mPlan:[0m 30 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @toshmackevics, Action: `pull_request`*